void main() {
  print(fibonaci(5));
}

int fibonaci(int n) {
  // Базовые случи 
  if (n == 0) {
    return 0;
  }

  if (n == 1) {
    return 1;
  }

  var res = fibonaci(n - 1) + fibonaci(n - 2);
  return res;
}

/**
 * fibonaci(5)
 * fibonaci(5 - 1) + fibonaci(5 - 2) 
 * --------------------------------------------------------
 * fibonaci(4) + fibonaci(4 - 2) -- программа проверяет что n != 1 и n != 0 и опускается ниже
 * --------------------------------------------------------
 * fibonaci(3) + fibonaci(3 - 2)
 * --------------------------------------------------------
 * fibonaci(2) + fibonaci(2 - 2) 
 * --------------------------------------------------------
 * (fibonaci(1) + fibonaci(1 - 2)) 
 * --------------------------------------------------------
 * 1 + fibonaci(1 - 2)
 */



